MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/include/proc/p32mx575f512h.h
extern volatile __C1FIFOCI11bits_t C1FIFOCI11bits __asm__ ("C1FIFOCI11") __attribute__((section("sfrs"), address(0xBF88B640)));
extern volatile uint32_t        C1FIFOCI11CLR __attribute__((section("sfrs"),address(0xBF88B644)));
extern volatile uint32_t        C1FIFOCI11SET __attribute__((section("sfrs"),address(0xBF88B648)));
extern volatile uint32_t        C1FIFOCI11INV __attribute__((section("sfrs"),address(0xBF88B64C)));
#define C1FIFOCON12 C1FIFOCON12
extern volatile uint32_t   C1FIFOCON12 __attribute__((section("sfrs"), address(0xBF88B650)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCON12bits_t;
extern volatile __C1FIFOCON12bits_t C1FIFOCON12bits __asm__ ("C1FIFOCON12") __attribute__((section("sfrs"), address(0xBF88B650)));
extern volatile uint32_t        C1FIFOCON12CLR __attribute__((section("sfrs"),address(0xBF88B654)));
extern volatile uint32_t        C1FIFOCON12SET __attribute__((section("sfrs"),address(0xBF88B658)));
extern volatile uint32_t        C1FIFOCON12INV __attribute__((section("sfrs"),address(0xBF88B65C)));
#define C1FIFOINT12 C1FIFOINT12
extern volatile uint32_t   C1FIFOINT12 __attribute__((section("sfrs"), address(0xBF88B660)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOINT12bits_t;
extern volatile __C1FIFOINT12bits_t C1FIFOINT12bits __asm__ ("C1FIFOINT12") __attribute__((section("sfrs"), address(0xBF88B660)));
extern volatile uint32_t        C1FIFOINT12CLR __attribute__((section("sfrs"),address(0xBF88B664)));
extern volatile uint32_t        C1FIFOINT12SET __attribute__((section("sfrs"),address(0xBF88B668)));
extern volatile uint32_t        C1FIFOINT12INV __attribute__((section("sfrs"),address(0xBF88B66C)));
#define C1FIFOUA12 C1FIFOUA12
extern volatile uint32_t   C1FIFOUA12 __attribute__((section("sfrs"), address(0xBF88B670)));
extern volatile uint32_t        C1FIFOUA12CLR __attribute__((section("sfrs"),address(0xBF88B674)));
extern volatile uint32_t        C1FIFOUA12SET __attribute__((section("sfrs"),address(0xBF88B678)));
extern volatile uint32_t        C1FIFOUA12INV __attribute__((section("sfrs"),address(0xBF88B67C)));
#define C1FIFOCI12 C1FIFOCI12
extern volatile uint32_t   C1FIFOCI12 __attribute__((section("sfrs"), address(0xBF88B680)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCI12bits_t;
extern volatile __C1FIFOCI12bits_t C1FIFOCI12bits __asm__ ("C1FIFOCI12") __attribute__((section("sfrs"), address(0xBF88B680)));
extern volatile uint32_t        C1FIFOCI12CLR __attribute__((section("sfrs"),address(0xBF88B684)));
extern volatile uint32_t        C1FIFOCI12SET __attribute__((section("sfrs"),address(0xBF88B688)));
extern volatile uint32_t        C1FIFOCI12INV __attribute__((section("sfrs"),address(0xBF88B68C)));
#define C1FIFOCON13 C1FIFOCON13
extern volatile uint32_t   C1FIFOCON13 __attribute__((section("sfrs"), address(0xBF88B690)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCON13bits_t;
extern volatile __C1FIFOCON13bits_t C1FIFOCON13bits __asm__ ("C1FIFOCON13") __attribute__((section("sfrs"), address(0xBF88B690)));
extern volatile uint32_t        C1FIFOCON13CLR __attribute__((section("sfrs"),address(0xBF88B694)));
extern volatile uint32_t        C1FIFOCON13SET __attribute__((section("sfrs"),address(0xBF88B698)));
extern volatile uint32_t        C1FIFOCON13INV __attribute__((section("sfrs"),address(0xBF88B69C)));
#define C1FIFOINT13 C1FIFOINT13
extern volatile uint32_t   C1FIFOINT13 __attribute__((section("sfrs"), address(0xBF88B6A0)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOINT13bits_t;
extern volatile __C1FIFOINT13bits_t C1FIFOINT13bits __asm__ ("C1FIFOINT13") __attribute__((section("sfrs"), address(0xBF88B6A0)));
extern volatile uint32_t        C1FIFOINT13CLR __attribute__((section("sfrs"),address(0xBF88B6A4)));
extern volatile uint32_t        C1FIFOINT13SET __attribute__((section("sfrs"),address(0xBF88B6A8)));
extern volatile uint32_t        C1FIFOINT13INV __attribute__((section("sfrs"),address(0xBF88B6AC)));
#define C1FIFOUA13 C1FIFOUA13
extern volatile uint32_t   C1FIFOUA13 __attribute__((section("sfrs"), address(0xBF88B6B0)));
extern volatile uint32_t        C1FIFOUA13CLR __attribute__((section("sfrs"),address(0xBF88B6B4)));
extern volatile uint32_t        C1FIFOUA13SET __attribute__((section("sfrs"),address(0xBF88B6B8)));
extern volatile uint32_t        C1FIFOUA13INV __attribute__((section("sfrs"),address(0xBF88B6BC)));
#define C1FIFOCI13 C1FIFOCI13
extern volatile uint32_t   C1FIFOCI13 __attribute__((section("sfrs"), address(0xBF88B6C0)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCI13bits_t;
extern volatile __C1FIFOCI13bits_t C1FIFOCI13bits __asm__ ("C1FIFOCI13") __attribute__((section("sfrs"), address(0xBF88B6C0)));
extern volatile uint32_t        C1FIFOCI13CLR __attribute__((section("sfrs"),address(0xBF88B6C4)));
extern volatile uint32_t        C1FIFOCI13SET __attribute__((section("sfrs"),address(0xBF88B6C8)));
extern volatile uint32_t        C1FIFOCI13INV __attribute__((section("sfrs"),address(0xBF88B6CC)));
#define C1FIFOCON14 C1FIFOCON14
extern volatile uint32_t   C1FIFOCON14 __attribute__((section("sfrs"), address(0xBF88B6D0)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCON14bits_t;
extern volatile __C1FIFOCON14bits_t C1FIFOCON14bits __asm__ ("C1FIFOCON14") __attribute__((section("sfrs"), address(0xBF88B6D0)));
extern volatile uint32_t        C1FIFOCON14CLR __attribute__((section("sfrs"),address(0xBF88B6D4)));
extern volatile uint32_t        C1FIFOCON14SET __attribute__((section("sfrs"),address(0xBF88B6D8)));
extern volatile uint32_t        C1FIFOCON14INV __attribute__((section("sfrs"),address(0xBF88B6DC)));
#define C1FIFOINT14 C1FIFOINT14
extern volatile uint32_t   C1FIFOINT14 __attribute__((section("sfrs"), address(0xBF88B6E0)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOINT14bits_t;
extern volatile __C1FIFOINT14bits_t C1FIFOINT14bits __asm__ ("C1FIFOINT14") __attribute__((section("sfrs"), address(0xBF88B6E0)));
extern volatile uint32_t        C1FIFOINT14CLR __attribute__((section("sfrs"),address(0xBF88B6E4)));
extern volatile uint32_t        C1FIFOINT14SET __attribute__((section("sfrs"),address(0xBF88B6E8)));
extern volatile uint32_t        C1FIFOINT14INV __attribute__((section("sfrs"),address(0xBF88B6EC)));
#define C1FIFOUA14 C1FIFOUA14
extern volatile uint32_t   C1FIFOUA14 __attribute__((section("sfrs"), address(0xBF88B6F0)));
extern volatile uint32_t        C1FIFOUA14CLR __attribute__((section("sfrs"),address(0xBF88B6F4)));
extern volatile uint32_t        C1FIFOUA14SET __attribute__((section("sfrs"),address(0xBF88B6F8)));
extern volatile uint32_t        C1FIFOUA14INV __attribute__((section("sfrs"),address(0xBF88B6FC)));
#define C1FIFOCI14 C1FIFOCI14
extern volatile uint32_t   C1FIFOCI14 __attribute__((section("sfrs"), address(0xBF88B700)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCI14bits_t;
extern volatile __C1FIFOCI14bits_t C1FIFOCI14bits __asm__ ("C1FIFOCI14") __attribute__((section("sfrs"), address(0xBF88B700)));
extern volatile uint32_t        C1FIFOCI14CLR __attribute__((section("sfrs"),address(0xBF88B704)));
extern volatile uint32_t        C1FIFOCI14SET __attribute__((section("sfrs"),address(0xBF88B708)));
extern volatile uint32_t        C1FIFOCI14INV __attribute__((section("sfrs"),address(0xBF88B70C)));
#define C1FIFOCON15 C1FIFOCON15
extern volatile uint32_t   C1FIFOCON15 __attribute__((section("sfrs"), address(0xBF88B710)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCON15bits_t;
extern volatile __C1FIFOCON15bits_t C1FIFOCON15bits __asm__ ("C1FIFOCON15") __attribute__((section("sfrs"), address(0xBF88B710)));
extern volatile uint32_t        C1FIFOCON15CLR __attribute__((section("sfrs"),address(0xBF88B714)));
extern volatile uint32_t        C1FIFOCON15SET __attribute__((section("sfrs"),address(0xBF88B718)));
extern volatile uint32_t        C1FIFOCON15INV __attribute__((section("sfrs"),address(0xBF88B71C)));
#define C1FIFOINT15 C1FIFOINT15
extern volatile uint32_t   C1FIFOINT15 __attribute__((section("sfrs"), address(0xBF88B720)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOINT15bits_t;
extern volatile __C1FIFOINT15bits_t C1FIFOINT15bits __asm__ ("C1FIFOINT15") __attribute__((section("sfrs"), address(0xBF88B720)));
extern volatile uint32_t        C1FIFOINT15CLR __attribute__((section("sfrs"),address(0xBF88B724)));
extern volatile uint32_t        C1FIFOINT15SET __attribute__((section("sfrs"),address(0xBF88B728)));
extern volatile uint32_t        C1FIFOINT15INV __attribute__((section("sfrs"),address(0xBF88B72C)));
#define C1FIFOUA15 C1FIFOUA15
extern volatile uint32_t   C1FIFOUA15 __attribute__((section("sfrs"), address(0xBF88B730)));
extern volatile uint32_t        C1FIFOUA15CLR __attribute__((section("sfrs"),address(0xBF88B734)));
extern volatile uint32_t        C1FIFOUA15SET __attribute__((section("sfrs"),address(0xBF88B738)));
extern volatile uint32_t        C1FIFOUA15INV __attribute__((section("sfrs"),address(0xBF88B73C)));
#define C1FIFOCI15 C1FIFOCI15
extern volatile uint32_t   C1FIFOCI15 __attribute__((section("sfrs"), address(0xBF88B740)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCI15bits_t;
